emacs/org-mode/org-todo-review.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-02 Tue 08:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hack Chyson" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3d9de3d">1. Todo basics</a></li>
<li><a href="#orgf26d781">2. Todo extensions</a>
<ul>
<li><a href="#org346a5c5">2.1. Todo keywords as workflow states</a></li>
<li><a href="#orgc2f604a">2.2. Todo keyworks as types</a></li>
<li><a href="#orgf5e8bcf">2.3. Multiple keywords sets in one file</a></li>
<li><a href="#org9d9c00c">2.4. Fast access to TODO states</a></li>
<li><a href="#org77c4d3c">2.5. Setting up keywords for individual files</a></li>
<li><a href="#org60d2068">2.6. Faces for TODO keywords</a></li>
<li><a href="#orgdcacee5">2.7. Todo dependencies</a></li>
</ul>
</li>
<li><a href="#org64f0b52">3. Progress logging</a>
<ul>
<li><a href="#org94d6752">3.1. Closing items</a></li>
<li><a href="#orga3189fe">3.2. Tracking TODO state changes</a></li>
</ul>
</li>
<li><a href="#org742c1c5">4. Priorities</a></li>
<li><a href="#orgb5f5738">5. Breaking down tasks</a></li>
<li><a href="#orgbdcdc23">6. Checkboxes</a></li>
</ul>
</div>
</div>
<p>
Org mode does not maintain TODO lists as separate documents.<br />
Instead, TODO items are an integral part of the notes file, because TODO items usually come up while taking notes!<br />
</p>

<div id="outline-container-org3d9de3d" class="outline-2">
<h2 id="org3d9de3d"><span class="section-number-2">1</span> Todo basics</h2>
<div class="outline-text-2" id="text-1">
<p>
Any headline become a TODO item when it starts with the word 'TODO'.<br />
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Bounding</th>
<th scope="col" class="org-left">Functions</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c C-t</td>
<td class="org-left">org-todo</td>
<td class="org-left">Rotate the TODO state of the current item (ummarked, TODO, DONE)</td>
</tr>

<tr>
<td class="org-left">S-RIGHT</td>
<td class="org-left">org-shiftright</td>
<td class="org-left">Switch to the next TODO keyword. (on a headline)</td>
</tr>

<tr>
<td class="org-left">S-LEFT</td>
<td class="org-left">org-shiftleft</td>
<td class="org-left">Switch to the previous TODO keyword. (on a headline)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-orgf26d781" class="outline-2">
<h2 id="orgf26d781"><span class="section-number-2">2</span> Todo extensions</h2>
<div class="outline-text-2" id="text-2">
<p>
By default, marked TODO entries have one of only two states: TODO and DONE.<br />
</p>
</div>
<div id="outline-container-org346a5c5" class="outline-3">
<h3 id="org346a5c5"><span class="section-number-3">2.1</span> Todo keywords as workflow states</h3>
<div class="outline-text-3" id="text-2-1">
<p>
You can use TODO keywords to indicate different sequential states in the process of working on an item, for example:<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keywords
  '((sequence <span style="color: #e9b96e;">"TODO"</span> <span style="color: #e9b96e;">"FEEDBACK"</span> <span style="color: #e9b96e;">"VERIFY"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"DONE"</span> <span style="color: #e9b96e;">"DELEGATED"</span>)))
</pre>
</div>

<p>
The vertical bar separates the TODO keywords (states that need action) from the DONE states (which need no further action).<br />
If you don't provide the separator bar, the last state is used as DONE state.<br />
With this step, the command "C-c C-t" will cycle an entry from TODO to FEEDBACK, then VERIFY, and finally to DONE and DELEGATED.<br />
</p>
</div>
</div>


<div id="outline-container-orgc2f604a" class="outline-3">
<h3 id="orgc2f604a"><span class="section-number-3">2.2</span> Todo keyworks as types</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keywords
  '((type <span style="color: #e9b96e;">"Fred"</span> <span style="color: #e9b96e;">"Hack"</span> <span style="color: #e9b96e;">"Lucy"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"DONE"</span>)))
</pre>
</div>

<p>
In this case, different keywords do not indicate a sequence, but rather different types.<br />
So the normal work flow would be to assign a task to a person, and later to mark it DONE.<br />
</p>
</div>
</div>

<div id="outline-container-orgf5e8bcf" class="outline-3">
<h3 id="orgf5e8bcf"><span class="section-number-3">2.3</span> Multiple keywords sets in one file</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keywords
      '((sequence <span style="color: #e9b96e;">"TODO"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"DONE"</span>)
        (sequence <span style="color: #e9b96e;">"REPORT"</span> <span style="color: #e9b96e;">"BUG"</span> <span style="color: #e9b96e;">"KNOWNCAUSE"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"FIXED"</span>)
        (sequence <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"CANCELED"</span>)))
</pre>
</div>

<p>
In this setup, C-c C-t only operates within a subsequence.<br />
</p>

<p>
C-u C-u C-c C-t<br />
C-S-right<br />
C-S-left<br />
These keys jump from one TODO subset to the next.<br />
</p>

<p>
S-right<br />
S-left<br />
Walk through all keywords from all sets.<br />
</p>
</div>
</div>

<div id="outline-container-org9d9c00c" class="outline-3">
<h3 id="org9d9c00c"><span class="section-number-3">2.4</span> Fast access to TODO states</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keywords
      '((sequence <span style="color: #e9b96e;">"TODO(t)"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"DONE(d)"</span>)
        (sequence <span style="color: #e9b96e;">"REPORT(r)"</span> <span style="color: #e9b96e;">"BUG(b)"</span> <span style="color: #e9b96e;">"KNOWNCAUSE(k)"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"FIXED(f)"</span>)
        (sequence <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"CANCELED(c)"</span>)))
</pre>
</div>

<p>
If you then press "C-c C-t" followed by the selection key, the entry will be switched to this state.<br />
</p>
</div>
</div>


<div id="outline-container-org77c4d3c" class="outline-3">
<h3 id="org77c4d3c"><span class="section-number-3">2.5</span> Setting up keywords for individual files</h3>
<div class="outline-text-3" id="text-2-5">
<pre class="example">
#+TODO: TODO FEEDBACK VERIFY | DONE CANCELED

(you may also write #+SEQ_TODO to be explicit about the interpretation, but it means the same as #+TODO), or 

#+TYP_TODO: Fred Hack Lucy | DONE
</pre>

<p>
Several sets in parallel:<br />
</p>
<pre class="example">
#+TODO: TODO | DONE
#+TODO: REPORT BUG KNOWNCAUSE | FIXED
#+TODO: | CANCELED
</pre>

<p>
Note: After changing one of these lines, use C-c C-c with the cursor still in the line to make the changes known to Org mode.<br />
</p>
</div>
</div>

<div id="outline-container-org60d2068" class="outline-3">
<h3 id="org60d2068"><span class="section-number-3">2.6</span> Faces for TODO keywords</h3>
<div class="outline-text-3" id="text-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">org-todo-keyword-faces</td>
<td class="org-left">Faces for specific TODO keywords.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keyword-faces
      '((<span style="color: #e9b96e;">"TODO"</span> . org-warning) 
        (<span style="color: #e9b96e;">"STARTED"</span> . <span style="color: #e9b96e;">"yellow"</span>)
        (<span style="color: #e9b96e;">"CANCELED"</span> . (<span style="color: #e090d7;">:foreground</span> <span style="color: #e9b96e;">"blue"</span> <span style="color: #e090d7;">:weight</span> bold))))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdcacee5" class="outline-3">
<h3 id="orgdcacee5"><span class="section-number-3">2.7</span> Todo dependencies</h3>
<div class="outline-text-3" id="text-2-7">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Key Bounding</th>
<th scope="col" class="org-left">Functions</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-left">Variables</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">C-c C-x o</td>
<td class="org-left">org-toggle-ordered-property</td>
<td class="org-left">Toggle the ORDERED property of the current entry</td>
<td class="org-left">org-enforce-todo-dependencies</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>



<div id="outline-container-org64f0b52" class="outline-2">
<h2 id="org64f0b52"><span class="section-number-2">3</span> Progress logging</h2>
<div class="outline-text-2" id="text-3">
<p>
Org mode can automatically record a timestamp and possibly a note when you mark a TODO item as DONE, or even each time you change the state of a TODO item.<br />
</p>
</div>

<div id="outline-container-org94d6752" class="outline-3">
<h3 id="org94d6752"><span class="section-number-3">3.1</span> Closing items</h3>
<div class="outline-text-3" id="text-3-1">
<p>
The most basic logging is to keep track of when a certain TODO item was finished.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-log-done 'time)
</pre>
</div>

<p>
Then each time you turn an entry from a TODO (not-done) state<br />
into any of the DONE states, a line ‘CLOSED: [timestamp]’ will<br />
be inserted just after the headline.<br />
</p>
</div>
</div>

<div id="outline-container-orga3189fe" class="outline-3">
<h3 id="orga3189fe"><span class="section-number-3">3.2</span> Tracking TODO state changes</h3>
<div class="outline-text-3" id="text-3-2">
<p>
To keep track of when a state change occurred and maybe take a note about this change:<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">setq</span> org-todo-keywords
  '((sequence <span style="color: #e9b96e;">"TODO(t)"</span> <span style="color: #e9b96e;">"WAIT(w@/!)"</span> <span style="color: #e9b96e;">"|"</span> <span style="color: #e9b96e;">"DONE(d!)"</span> <span style="color: #e9b96e;">"CANCELED(c@"</span>)))
</pre>
</div>

<p>
Since it is normally too much to record a note for every state, Org mode expects configuration on a per-keyword basis for this.<br />
This is achieved by adding special markers ‘!’ (for a timestamp) or ‘@’ (for a note with timestamp) in parentheses after each keyword.<br />
</p>

<pre class="example">
Only one marker, it is for both entering and exiting;
marker/maeker, the first marker is for entering, the latter is for exiting;
</pre>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">org-log-into-drawer</td>
</tr>
</tbody>
</table>

<pre class="example">
#+STARTUP: logdrawer
</pre>
</div>
</div>
</div>


<div id="outline-container-org742c1c5" class="outline-2">
<h2 id="org742c1c5"><span class="section-number-2">4</span> Priorities</h2>
<div class="outline-text-2" id="text-4">
<p>
Prioritizing can be done by placing a 'priority cookie' into the headline item.<br />
</p>

<pre class="example">
*** TODO [#A] Write letter to Sam Fortune
</pre>

<p>
By default, Org mode supports three priorities: ‘A’, ‘B’, and ‘C’.<br />
‘A’ is the highest priority.<br />
An entry without a cookie is treated just like priority ‘B’.<br />
</p>

<p>
<i>C-c ,</i> (<code>org-priority</code>)<br />
Set the priority of the current headline.<br />
</p>

<p>
<i>S-up</i> <br />
<i>S-down</i><br />
Increase/decrease priority of current headline.<br />
</p>
</div>
</div>

<div id="outline-container-orgb5f5738" class="outline-2">
<h2 id="orgb5f5738"><span class="section-number-2">5</span> Breaking down tasks</h2>
<div class="outline-text-2" id="text-5">
<p>
Break down large tasks into smaller, manageable subtasks by<br />
creating an outline tree below a TODO item,<br />
with detailed subtasks on the tree.<br />
</p>

<p>
To keep the overview over the fraction of subtasks that are already completed,<br />
insert either ‘<code>[/]</code>’ or ‘<code>[%]</code>’ anywhere in the headline.<br />
These cookies will be updated each time the TODO status of a child changes,<br />
or when pressing C-c C-c on the cookie<br />
</p>

<pre class="example">
* TODO Organize Party [33%]
** TODO Call people [1/2]
*** TODO Peter
*** DONE Sarah
** TODO Buy food
** DONE Talk to neighbor
</pre>


<p>
If you would like to have the statistics cookie count any TODO entries in the subtree (not just direct children),<br />
configure <code>org-hierarchical-todo-statistics</code>.<br />
To do this for a single subtree, include the word ‘recursive’ into the value of the COOKIE_DATA property.<br />
</p>

<pre class="example">
* Parent capturing statistics [2/20]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :END:      
</pre>


<p>
If you would like a TODO entry to automatically change to DONE when all children are done.<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #b4fa70;">defun</span> <span style="color: #fce94f;">org-summary-todo</span> (n-done n-not-done)
  <span style="color: #e9b96e;">"Switch entry to DONE when all subentries are done, to TODO otherwise."</span>
  (<span style="color: #b4fa70;">let</span> (org-log-done org-log-states)   <span style="color: #73d216;">; </span><span style="color: #73d216;">turn off logging</span>
    (org-todo (<span style="color: #b4fa70;">if</span> (= n-not-done 0) <span style="color: #e9b96e;">"DONE"</span> <span style="color: #e9b96e;">"TODO"</span>))))

(add-hook 'org-after-todo-statistics-hook 'org-summary-todo)
</pre>
</div>

<p>
To keep subtasks out of the global TODO list, customize <code>org-agenda-todo-list-sublevels</code>.<br />
</p>
</div>
</div>

<div id="outline-container-orgbdcdc23" class="outline-2">
<h2 id="orgbdcdc23"><span class="section-number-2">6</span> Checkboxes</h2>
<div class="outline-text-2" id="text-6">
<p>
Checkboxes are not included in the global TODO list,<br />
so they are often great to split a task into a number of simple steps.<br />
</p>

<pre class="example">
* TODO Organize party [2/4]
  - [-] call people [1/3]
    - [ ] Peter
    - [X] Sarah
    - [ ] Sam
  - [X] order food
  - [ ] think about what music to play
  - [X] talk to the neighbors
</pre>

<p>
In a headline, a cookie can count either checkboxes below the heading or<br />
TODO states of children, and it will display whatever was changed last.<br />
Set the property COOKIE_DATA to either ‘checkbox’ or ‘todo’ to resolve this issue.<br />
</p>


<p>
<i>C-c C-c</i> (<code>org-toggle-checkbox</code>)<br />
Toggle checkbox status.<br />
With a single prefix argument, add an empty checkbox or remove the current one.<br />
With a double prefix argument, set it to ‘[-]’, which is considered to be an intermediate state.<br />
</p>

<p>
<i>C-c C-x C-b</i> (<code>org-toggle-checkbox</code>)<br />
Can work on region.<br />
</p>

<p>
<i>M-S-RET</i> (<code>org-insert-todo-heading</code>)<br />
Insert a new item with a checkbox.<br />
</p>

<p>
<i>C-c C-x o</i> (<code>org-toggle-ordered-property</code>)<br />
Toggle the ORDERED property of the current entry.<br />
</p>


<p>
<i>C-c #</i> (<code>org-update-statistics-cookies</code>)<br />
Update the statistics cookie, either from TODO or from checkboxes.<br />
When called with a C-u prefix, update the entire file.<br />
Don't need to put the cursor on the cookie.<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hack Chyson</p>
<p class="date">Created: 2019-04-02 Tue 08:12</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
